# Pandas


## Key features

## Installation of pandas

## Pandas data structure

## Functionality of Series and Dataframe

## Statistic by pandas

## Pandas

It is an open-source library built on top of Python and it is used specifically for data manipulation and analysis

Pandas can be used for data visualization

## Key features

Can load different file format like CSV, Excel, Jason etc.

Handle missing data, messy data sets, clean data

Reshaping and pivoting of date sets.

Slicing, indexing and sub setting of large data sets.

Rows and columns from a data structure can be deleted or inserted.

Group by data for aggregation(sum, max, min, count etc.) and transformations.

Merging and joining of data.

Time Series functionality.

It will allows us to analyze big data and can conclude based on statistical measure.

## Pandas data structure

## Series

Pandas Series is nothing but a column in an excel sheet

It is a one-dimensional labeled array capable of holding data of any type (integer,list, string, float, python objects, etc.) but at a time only one data type can hold

Key Points 1: Homogeneous data 2 :Size Immutable 3 :Values of Data Mutable

## Dataframe

It is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns

A pandas DataFrame can be created using : Lists , dictionary , Series , Numpy ndarrays , Another DataFrame

Dataframe can hold:

Heterogeneous data (integer, string, float, python objects,) simultaneously and its size is mutable

In [ ]:
# pip install pandas ## do not run again and again only once

## Series

In [ ]:
# pip install pandas

In [1]:
import pandas

In [2]:
pandas.Series([10,20,30,40,50.8])

0    10.0
1    20.0
2    30.0
3    40.0
4    50.8
dtype: float64

In [3]:
pandas.Series(['a','b','c','d'])

0    a
1    b
2    c
3    d
dtype: object

In [4]:
import pandas as pd

In [10]:
pd.Series()

Series([], dtype: float64)

In [9]:
df = pd.Series()
df

Series([], dtype: float64)

In [11]:
import warnings as wa
wa.filterwarnings('ignore')

In [12]:
df

Series([], dtype: float64)

In [13]:
a = [1,2,3,4,5]
pd.Series(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
pd.Series([1,2,3,4,5.9])

0    1.0
1    2.0
2    3.0
3    4.0
4    5.9
dtype: float64

In [15]:
pd.Series([1,2,'3',4,5])

0    1
1    2
2    3
3    4
4    5
dtype: object

In [16]:
a

[1, 2, 3, 4, 5]

In [17]:
a = (1,2,3,4,5,10,203,343,678,567,45)
s = pd.Series(a,index=['a','b','c','d','e','f','g','o','p','i','k'])

In [18]:
s

a      1
b      2
c      3
d      4
e      5
f     10
g    203
o    343
p    678
i    567
k     45
dtype: int64

In [23]:
a = (1,2,3,4,5)
b = ['a','b','c','d','e']
s = pd.Series(a,index=b)
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [25]:

a = (1,2,3,4,5)
b = ['a','b','c','d','e']
s = pd.Series(b,index=a)
s

1    a
2    b
3    c
4    d
5    e
dtype: object

In [26]:
# creating a series through dictionary and look at dtype
a = {1:20,2:30,4:50,5:30} 
pd.Series(a)

1    20
2    30
4    50
5    30
dtype: int64

In [27]:
a = {1:20,2:30,'4':50,5:30} # look at dtype
pd.Series(a)

1    20
2    30
4    50
5    30
dtype: int64

In [28]:
a = {1:20,2:30,4:'50',5:30} # look at dtype
pd.Series(a)

1    20
2    30
4    50
5    30
dtype: object

In [29]:
a = {'z':30,'x':40.0,'w':20,'y':'60'} # look at dtype
pd.Series(a,index=['y','w','x','z'])

y      60
w      20
x    40.0
z      30
dtype: object

In [30]:
a = {'z':30,'x':40.0,'w':20,'y':60} # look at dtype
pd.Series(a,index=['w','x','y','z'])

w    20.0
x    40.0
y    60.0
z    30.0
dtype: float64

In [31]:
pd.Series(5)

0    5
dtype: int64

In [32]:
pd.Series(5 , index = range(5))

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [33]:
pd.Series(5,range(5))

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [34]:
b = pd.Series(range(5,15),range(10))
b

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [35]:
b[7] = 40
b

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    40
8    13
9    14
dtype: int64

In [36]:
b[-7:]

3     8
4     9
5    10
6    11
7    40
8    13
9    14
dtype: int64

## Dataframe
It is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns

A pandas DataFrame can be created using : Lists , dictionary , Series , Numpy ndarrays , Another DataFrame

Dataframe can hold:

Heterogeneous data (integer, string, float,objects,) simultaneously and its size is mutable

In [37]:
import pandas as pd

In [38]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [39]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [40]:
a = pd.DataFrame()
print(a)

Empty DataFrame
Columns: []
Index: []

In [41]:
pd.DataFrame(range(10),columns=['x']) # homogenous data which is integer

   x
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

In [42]:
d = [1,2,3,4,'a',3.9]
d

[1, 2, 3, 4, 'a', 3.9]

In [43]:
pd.DataFrame(d)

     0
0    1
1    2
2    3
3    4
4    a
5  3.9

In [46]:
a = pd.DataFrame(d,columns=['ukg'])
a

   ukg
0    1
1    2
2    3
3    4
4    a
5  3.9

In [51]:
a['ukg'][4]='90'
a

   ukg
0    1
1    2
2    3
3    4
4   90
5  3.9

In [54]:
a['y']=[12,2,3,4,5,3] # add column

In [55]:
a

   ukg   y
0    1  12
1    2   2
2    3   3
3    4   4
4   90   5
5  3.9   3

In [56]:
a['ukg'].dtype # O means object

dtype('O')

In [57]:
a['y'].dtype

dtype('int64')

In [58]:
d = ['Rani',30]
d

['Rani', 30]

In [59]:
df = pd.DataFrame(d)

In [60]:
df

      0
0  Rani
1    30

In [61]:
df = pd.DataFrame(d,columns= ['Name','Age'])
df

ValueError: Shape of passed values is (2, 1), indices imply (2, 2)

In [67]:
d = ['Rani',30]
df = pd.DataFrame([d],columns= [0,1])
df[1].dtype

dtype('int64')

In [68]:
d = [['Rani',30]]
pd.DataFrame(d,columns= ['Name','Age'])

   Name  Age
0  Rani   30

In [69]:
d = [['Rani',30],['Prem',32],['Rock',40]]
df = pd.DataFrame(d,columns= ['Name','Age'])

In [70]:
df

   Name  Age
0  Rani   30
1  Prem   32
2  Rock   40

In [71]:
d = {'name':['Rani','prem','Rock'],
     'Age':[30,32,40]
    }
df = pd.DataFrame(d)
df

   name  Age
0  Rani   30
1  prem   32
2  Rock   40

In [72]:
df['Age']

0    30
1    32
2    40
Name: Age, dtype: int64

In [73]:
df.shape

(3, 2)

In [74]:
df.size

6

In [75]:
d = {
    'col1':[1,2,3,4],
    'col2':['apple','kiwi','grapes',] # valuse
}

In [76]:
d1 = pd.DataFrame(d)
d1

ValueError: All arrays must be of the same length

In [77]:
''

''

In [81]:
d = {
    'col1':[1,2,3,4],
    'col2':['apple','kiwi','grapes','']
}
d1 = pd.DataFrame(d)
d1['col2'][3]
d1

   col1    col2
0     1   apple
1     2    kiwi
2     3  grapes
3     4

In [82]:
d1 = d1.drop(3,axis=0) # removing rows
d1

   col1    col2
0     1   apple
1     2    kiwi
2     3  grapes

In [83]:
d1 = d1.drop('col2',axis=1)
d1

   col1
0     1
1     2
2     3

In [84]:
del d1['col1']

In [85]:
d1

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [86]:
del d1

In [87]:
d1

NameError: name 'd1' is not defined

In [89]:
d = {
    'col1':[1,2,3,4],
    'col2':['apple','kiwi','grapes','']
}
d1 = pd.DataFrame(d)
d1['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [90]:
d1.pop('col2')

0     apple
1      kiwi
2    grapes
3
Name: col2, dtype: object

In [91]:
d1

   col1
0     1
1     2
2     3
3     4

In [92]:
import pandas as pd

In [93]:
d = {
    'nam@e  ' : ['Raju','Rahul','Pallavi','Anjali','Pavani','Vijay','Sai'],
    ' Ag@e  ' : [20,30,19,34,27,50,80],
    '  @Salary  ' : [1000,2000,3400,4000,2348,5400,3001]
}
df = pd.DataFrame(d) # columns name are with spaces

In [94]:
df

   nam@e     Ag@e      @Salary
0     Raju       20         1000
1    Rahul       30         2000
2  Pallavi       19         3400
3   Anjali       34         4000
4   Pavani       27         2348
5    Vijay       50         5400
6      Sai       80         3001

In [95]:
# here if i try to call a column there will be an error
df['nam@e']

KeyError: 'nam@e'

In [96]:
df.columns

Index(['nam@e  ', ' Ag@e  ', '  @Salary  '], dtype='object')

In [97]:
df['nam@e  ']

0       Raju
1      Rahul
2    Pallavi
3     Anjali
4     Pavani
5      Vijay
6        Sai
Name: nam@e  , dtype: object

In [98]:
df['Name'] = df['nam@e']

KeyError: 'nam@e'

In [99]:
'sell       '.strip()

'sell'

In [100]:
df.columns.str.strip()

Index(['nam@e', 'Ag@e', '@Salary'], dtype='object')

In [101]:
df.columns

Index(['nam@e  ', ' Ag@e  ', '  @Salary  '], dtype='object')

In [102]:
c = df.columns.str.strip()

In [103]:
c

Index(['nam@e', 'Ag@e', '@Salary'], dtype='object')

In [104]:
df.columns

Index(['nam@e  ', ' Ag@e  ', '  @Salary  '], dtype='object')

In [105]:
c = c.str.replace('@','')

In [106]:
c

Index(['name', 'Age', 'Salary'], dtype='object')

In [107]:
df.columns = c

In [108]:
df.columns

Index(['name', 'Age', 'Salary'], dtype='object')

In [111]:
df['Name']=df['name']

In [115]:
df.drop('name',axis = 1,inplace=True)

In [116]:
df

   Age  Salary     Name
0   20    1000     Raju
1   30    2000    Rahul
2   19    3400  Pallavi
3   34    4000   Anjali
4   27    2348   Pavani
5   50    5400    Vijay
6   80    3001      Sai

In [ ]:
# r = []
# for i in df['name']:
#     r.append(i.str.strip())
    
# df['clean_name'] = r

In [118]:
# import pandas as pd
d = {'na@m$e ':pd.Series(['tom ','dick','harry','jay','veeru','ram','laxman']),
   ' @age':pd.Series([-20,32,45,-32,32,14,15,38]),
   '  dat#i$ng':pd.Series([4.23,-3.24,3.98,2.56,-3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
# df.columns
df

  na@m$e    @age    dat#i$ng
0    tom     -20        4.23
1    dick     32       -3.24
2   harry     45        3.98
3     jay    -32        2.56
4   veeru     32       -3.20
5     ram     14        4.60
6  laxman     15        3.80
7     NaN     38         NaN

In [139]:
import pandas as pd
ff = ['tom ','dick','harry','jay','veeru','ram','laxman']
a = pd.Series(ff)
b = pd.Series([-20,32,45,-32,32,14,15,38])
c = pd.Series([4.23,-3.24,3.98,2.56,-3.20,4.6,3.8])

d = {'na@m$e ': a ,
   ' @age': b ,
   '  dat#i$ng': c
    }

# # #Create a DataFrame
df = pd.DataFrame(d)
df.columns
# df
# # df1 = df.rename(columns={'Name':'NAME','age':'AGE','dating':'Dating'})
# # df1

Index(['na@m$e ', ' @age', '  dat#i$ng'], dtype='object')

In [140]:
df['na@m$e']

KeyError: 'na@m$e'

In [141]:
c = df.columns.str.strip()
df.columns = c
df.columns

Index(['na@m$e', '@age', 'dat#i$ng'], dtype='object')

In [142]:
df1 = df.rename(columns={'na@m$e':'NAME','@age':'AGE', 'dat#i$ng':'DATING'})
df1

     NAME  AGE  DATING
0    tom   -20    4.23
1    dick   32   -3.24
2   harry   45    3.98
3     jay  -32    2.56
4   veeru   32   -3.20
5     ram   14    4.60
6  laxman   15    3.80
7     NaN   38     NaN

In [147]:
import pandas as pd
ff = ['tom ','dick','harry','jay','veeru','ram','laxman']
a = pd.Series(ff)
b = pd.Series([-20,32,45,-32,32,14,15,38])
c = pd.Series([4.23,-3.24,3.98,2.56,-3.20,4.6,3.8])

d = {'na@m$e ': a ,
   ' @age': b ,
   '  dat#i$ng': c
    }

# #Create a DataFrame
df = pd.DataFrame(d)
df.columns

Index(['na@m$e ', ' @age', '  dat#i$ng'], dtype='object')

In [148]:
c = df.columns.str.strip()
print(c)

Index(['na@m$e', '@age', 'dat#i$ng'], dtype='object')

In [149]:
# nested for loop

In [150]:
v = []

for i in c:
    f = ''
    for j in i:
        if j=='@' or j=='#' or j=='$':
            f = f+''
            
        else:
            f = f + j
            
    v.append(f)
#         print(j)
v

['name', 'age', 'dating']

In [151]:
df.columns = v
df

     name  age  dating
0    tom   -20    4.23
1    dick   32   -3.24
2   harry   45    3.98
3     jay  -32    2.56
4   veeru   32   -3.20
5     ram   14    4.60
6  laxman   15    3.80
7     NaN   38     NaN

## drop

In [152]:
df

     name  age  dating
0    tom   -20    4.23
1    dick   32   -3.24
2   harry   45    3.98
3     jay  -32    2.56
4   veeru   32   -3.20
5     ram   14    4.60
6  laxman   15    3.80
7     NaN   38     NaN

In [153]:
df.drop(5,axis=0,inplace=True) # to remove rows

In [154]:
df

     name  age  dating
0    tom   -20    4.23
1    dick   32   -3.24
2   harry   45    3.98
3     jay  -32    2.56
4   veeru   32   -3.20
6  laxman   15    3.80
7     NaN   38     NaN

In [155]:
df['Name'] = df['name']
df

     name  age  dating    Name
0    tom   -20    4.23    tom
1    dick   32   -3.24    dick
2   harry   45    3.98   harry
3     jay  -32    2.56     jay
4   veeru   32   -3.20   veeru
6  laxman   15    3.80  laxman
7     NaN   38     NaN     NaN

In [156]:
df.drop('name',axis=1,inplace=True) # mutable if i give inplace

In [157]:
df

   age  dating    Name
0  -20    4.23    tom
1   32   -3.24    dick
2   45    3.98   harry
3  -32    2.56     jay
4   32   -3.20   veeru
6   15    3.80  laxman
7   38     NaN     NaN

In [160]:
df1 = df.rename(columns={'Name':'NAME','age':'AGE','dating':'Dating'})
df1

   AGE  Dating    NAME
0  -20    4.23    tom
1   32   -3.24    dick
2   45    3.98   harry
3  -32    2.56     jay
4   32   -3.20   veeru
6   15    3.80  laxman
7   38     NaN     NaN